## Plan Result (terraform/container_registry)

[CI link](https://github.com/nakashima-yuta23-fixer/github_actions_triger_terraform/actions/runs/10765622727)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.container_registry.azurerm_container_registry.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.container_registry.azurerm_container_registry.this must be replaced
-/+ resource "azurerm_container_registry" "this" {
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/db9f0eac-7ae4-4b1e-aeb9-7455410c8395/resourceGroups/rg-nytes1-dev-je/providers/Microsoft.ContainerRegistry/registries/acrnytes1dvje" -> (known after apply)
      ~ login_server                  = "acrnytes1dvje.azurecr.io" -> (known after apply)
      ~ name                          = "acrnytes1dvje" -> "acrnytes1devje" # forces replacement
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      - tags                          = {} -> null
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull_request-triger","PRNumber":8,"Program":"tfcmt","SHA1":"db0cada5793213e50eb93bd8837e578387003f59","Target":"terraform/container_registry","Vars":{},"WorkflowName":"Pull request trigger"} -->